ResNet(
  (trunk): Sequential(
    (0): Conv2d(3, 64, kernel_size=(7, 7), stride=(2, 2), padding=(3, 3), bias=False)
    (1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (2): ReLU()
    (3): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    (4): BottleneckBlock(
      (C1): Conv2d(64, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
      (shortcut): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (5): BottleneckBlock(
      (C1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (6): BottleneckBlock(
      (C1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (7): BottleneckBlock(
      (C1): Conv2d(256, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(128, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
      (BN2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(128, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
      (shortcut): Conv2d(256, 512, kernel_size=(1, 1), stride=(2, 2), bias=False)
    )
    (8): BottleneckBlock(
      (C1): Conv2d(512, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(128, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (9): BottleneckBlock(
      (C1): Conv2d(512, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(128, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (10): BottleneckBlock(
      (C1): Conv2d(512, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(128, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (11): BottleneckBlock(
      (C1): Conv2d(512, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
      (shortcut): Conv2d(512, 1024, kernel_size=(1, 1), stride=(2, 2), bias=False)
    )
    (12): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (13): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (14): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (15): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (16): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (17): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (18): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (19): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (20): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (21): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (22): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (23): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (24): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (25): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (26): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (27): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (28): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (29): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (30): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (31): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (32): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (33): BottleneckBlock(
      (C1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(256, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (34): BottleneckBlock(
      (C1): Conv2d(1024, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(512, 512, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
      (BN2): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(512, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
      (shortcut): Conv2d(1024, 2048, kernel_size=(1, 1), stride=(2, 2), bias=False)
    )
    (35): BottleneckBlock(
      (C1): Conv2d(2048, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(512, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (36): BottleneckBlock(
      (C1): Conv2d(2048, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN1): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C2): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (BN2): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (C3): Conv2d(512, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (BN3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU()
    )
    (37): AvgPool2d(kernel_size=7, stride=7, padding=0)
    (38): Flatten()
  )
)